class UpImages():

    def FlyAndLandAnimals(self):

        fly_animal_url = [
            ["fly", "v2/通用/动物/6_特殊类别_蝴蝶/蝴蝶_F1.svg"],
            ["fly", "v2/通用/动物/1-动物基础分类/鸟类动物/小鸟组合_1组/小鸟_L1.svg"],
            ["fly", "v2/通用/动物/1-动物基础分类/鸟类动物/小鸟组合_1组/小鸟_L2.svg"],
            ["fly", "v2/通用/动物/1-动物基础分类/鸟类动物/小鸟组合_1组/小鸟_L3.svg"],
            ["]fly", "v2/通用/动物/1-动物基础分类/鸟类动物/小鸟组合_1组/小鸟_R2.svg"],
            ["fly", "v2/通用/动物/1-动物基础分类/鸟类动物/鸟类动物_2组/Left/飞翔的鸟_L1.svg"],
            ["fly", "v2/通用/动物/2-特殊分类-能飞的/蜻蜓_L1.svg"],

        ]

        land_animal_url = [
            ["run", "v2/通用/动物/4-特殊类别-猴子/猴子_L1.svg"],
            ["run", "v2/通用/动物/5_特殊类别-猫/猫_L1.svg"],
            ["run", "v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_1组/Right/山羊_R1.svg"],
            ["run", "v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_1组/Right/小狗_R1.svg"],
            ["run", "v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_1组/Right/猪_R1.svg"],
            ["run", "v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_3组/Right/狐狸_R1.svg"],
            ["run", "v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_2组/Right/小羊_R1.svg"],
            ["run", "v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_3组/Right/斑马_R1.svg"],
            ["run", "v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_3组/Right/大象_R1.svg"],
            ["run", "v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_3组/Right/袋鼠_R1.svg"],
            ["run", "v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_3组/Right/河马_R1.svg"],
            ["run", "v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_3组/Right/老虎_R1.svg"],
            ["run", "v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_3组/Right/骆驼_R1.svg"],
            ["run", "v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_3组/Right/牛_R1.svg"],
        ]

        return fly_animal_url,land_animal_url

    def SketchAnimal(self):
        images_fly_url=[
            ["v2/通用/动物/1-动物基础分类/节肢动物/Front/蝴蝶_F1.svg","fly","v2/组件/分类与整理/1-4-1-02/会飞的-线描-蝴蝶.svg"],
            ["v2/通用/动物/1-动物基础分类/节肢动物/Left/蜜蜂_L2.svg","fly","v2/组件/分类与整理/1-4-1-02/会飞的-线描-蜜蜂.svg"],
            ["v2/通用/动物/2-特殊分类-能飞的/蜻蜓_F1.svg","fly","v2/组件/分类与整理/1-4-1-02/会飞的-线描-蜻蜓.svg"],
            ["v2/组件/分类与整理/1-4-1-02/会飞的-带色-小鸟.svg","fly","v2/组件/分类与整理/1-4-1-02/会飞的-线描-小鸟.svg"],
            ["v2/通用/动物/2-特殊分类-能飞的/鹦鹉_带棍F1.svg","fly","v2/组件/分类与整理/1-4-1-02/会飞的-线描-鹦鹉.svg"],

        ]

        images_run_url=[
            ["v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_1组/Left/牛_L1.svg", "run", "v2/组件/分类与整理/1-4-1-02/地上跑的-线描-奶牛.svg"],
            ["v2/组件/分类与整理/1-4-1-02/地上跑的-带色-山羊.svg", "run", "v2/组件/分类与整理/1-4-1-02/地上跑的-线描-山羊.svg"],
            ["v2/组件/分类与整理/1-4-1-02/地上跑的-带色-松鼠R.svg", "run", "v2/组件/分类与整理/1-4-1-02/地上跑的-线描-松鼠.svg"],
            ["v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_1组/Right/小狗_R1.svg", "run", "v2/组件/分类与整理/1-4-1-02/地上跑的-线描-小狗.svg"],
            ["v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_1组/Right/猪_R1.svg", "run", "v2/组件/分类与整理/1-4-1-02/地上跑的-线描-小猪.svg"],

        ]

        images_swim_url=[
            ["v2/通用/动物/1-动物基础分类/鱼类动物/Left/海马_L2.svg", "swim", "v2/组件/分类与整理/1-4-1-02/水里游的-线描-海马.svg"],
            ["v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_2组/Left/海豚_L1.svg", "swim", "v2/组件/分类与整理/1-4-1-02/水里游的-线描-海豚.svg"],
            ["v2/通用\动物/1-动物基础分类/鱼类动物/Left/鱼_L6.svg", "swim", "v2/组件/分类与整理/1-4-1-02/水里游的-线描-鱼1.svg"],
            ["v2/通用\动物/1-动物基础分类/鱼类动物/Left/鱼_L1.svg", "swim", "v2/组件/分类与整理/1-4-1-02/水里游的-线描-鱼2.svg"],
            ["v2/通用/动物/3-特殊分类_能游的/鱼_L4.svg", "swim", "v2/组件/分类与整理/1-4-1-02/水里游的-线描-鱼3.svg"],
        ]
        return images_fly_url,images_run_url,images_swim_url

    def PlantAndAnimal(self):
        images_animal_url = [
            ["animal", "v2/通用/动物/4-特殊类别-猴子/猴子_L1.svg"],
            ["animal", "v2/通用/动物/5_特殊类别-猫/猫_L1.svg"],
            ["animal", "v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_1组/Right/山羊_R1.svg"],
            ["animal", "v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_1组/Right/小狗_R1.svg"],
            ["animal", "v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_1组/Right/猪_R1.svg"],
            ["animal", "v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_3组/Right/狐狸_R1.svg"],
            ["animal", "v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_2组/Right/小羊_R1.svg"],
            ["animal", "v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_3组/Right/斑马_R1.svg"],
            ["animal", "v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_3组/Right/大象_R1.svg"],
            ["animal", "v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_3组/Right/袋鼠_R1.svg"],
            ["animal", "v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_3组/Right/河马_R1.svg"],
            ["animal", "v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_3组/Right/老虎_R1.svg"],
            ["animal", "v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_3组/Right/骆驼_R1.svg"],
            ["animal", "v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_3组/Right/牛_R1.svg"],
            ["animal", "v2/通用/动物/6_特殊类别_蝴蝶/蝴蝶_F1.svg"],
            ["animal", "v2/通用/动物/1-动物基础分类/鸟类动物/小鸟组合_1组/小鸟_L1.svg"],
            ["animal", "v2/通用/动物/1-动物基础分类/鸟类动物/小鸟组合_1组/小鸟_L2.svg"],
            ["animal", "v2/通用/动物/1-动物基础分类/鸟类动物/小鸟组合_1组/小鸟_L3.svg"],
            ["animal", "v2/通用/动物/1-动物基础分类/鸟类动物/小鸟组合_1组/小鸟_R2.svg"],
            ["animal", "v2/通用/动物/1-动物基础分类/鸟类动物/鸟类动物_2组/Left/飞翔的鸟_L1.svg"],
            ["animal", "v2/通用/动物/2-特殊分类-能飞的/蜻蜓_L1.svg"],
        ]

        images_plant_url = [
            ["plant", "v2/通用/蔬菜/蔬菜（无边框）/黄椒_1.svg"],
            ["plant", "v2/通用/蔬菜/蔬菜（无边框）/土豆.svg"],
            ["plant", "v2/通用/植物/树苗.svg"],
            ["plant", "v2/通用/植物/竹子/竹子_1.svg"],
            ["plant", "v2/通用/蔬菜/蔬菜（无边框）/小白萝卜.svg"],
            ["plant", "v2/通用/蔬菜/蔬菜（无边框）/小萝卜_1.svg"],
            ["plant", "v2/通用/蔬菜/蔬菜（无边框）/黄瓜_1.svg"],
            ["plant", "v2/通用/植物/草/草_1.svg"],
            ["plant", "v2/通用/植物/草/草_2.svg"],
            ["plant", "v2/通用/植物/草/草_3.svg"],
            ["plant", "v2/通用/植物/草/草_4.svg"],
            ["plant", "v2/通用/植物/草/草_5.svg"],
            ["plant", "v2/通用/植物/草/草_6.svg"],
            ["plant", "v2/通用/植物/草/草_7.svg"],
            ["plant", "v2/通用/植物/草/草_8.svg"],
            ["plant", "v2/通用/植物/小麦/小麦_1.svg"],
            ["plant", "v2/通用/植物/盆栽/盆栽-3.svg"],
            ["plant", "v2/通用/植物/盆栽/盆栽-4.svg"],
            ["plant", "v2/通用/植物/盆栽/盆栽-5.svg"],


        ]
        return images_animal_url,images_plant_url

    def FruitAndVagetable(self):
        images_fruit_url=[
            ["v2/通用/水果/菠萝.svg", "fruit", 1],
            ["v2/通用/水果/草莓_1.svg", "fruit", 1],
            ["v2/通用/水果/黄苹果.svg", "fruit", 1],
            ["v2/通用/水果/桔子_1.svg", "fruit", 1],
            ["v2/通用/水果/开口香蕉_1.svg", "fruit", 1],
            ["v2/通用/水果/蓝莓.svg", "fruit", 1],
            ["v2/通用/水果/梨.svg", "fruit", 1],
            ["v2/通用/水果/芒果.svg", "fruit", 1],
            ["v2/通用/水果/柠檬.svg", "fruit", 1],
            ["v2/通用/水果/苹果_1.svg", "fruit", 1],
            ["v2/通用/水果/桃子.svg", "fruit", 1],
            ["v2/通用/水果/西瓜_1.svg", "fruit", 1],
            ["v2/通用/水果/青苹果.svg", "fruit", 1],

        ]

        images_vegetable_url=[

            ["v2/通用/蔬菜/蔬菜（无边框）/包菜_1.svg", "vegetable", 0],
            ["v2/通用/蔬菜/蔬菜（无边框）/红椒_1.svg", "vegetable", 0],
            ["v2/通用/蔬菜/蔬菜（无边框）/胡萝卜1.svg", "vegetable", 0],
            ["v2/通用/蔬菜/蔬菜（无边框）/花菜_2.svg", "vegetable", 0],
            ["v2/通用/蔬菜/蔬菜（无边框）/黄瓜_1.svg", "vegetable", 0],
            ["v2/通用/蔬菜/蔬菜（无边框）/黄椒_1.svg", "vegetable", 0],
            ["v2/通用/蔬菜/蔬菜（无边框）/蘑菇_1.svg", "vegetable", 0],
            ["v2/通用/蔬菜/蔬菜（无边框）/南瓜_1.svg", "vegetable", 0],
            ["v2/通用/蔬菜/蔬菜（无边框）/茄子1.svg", "vegetable", 0],
            ["v2/通用/蔬菜/蔬菜（无边框）/青椒.svg", "vegetable", 0],
            ["v2/通用/蔬菜/蔬菜（无边框）/丝瓜.svg", "vegetable", 0],
            ["v2/通用/蔬菜/蔬菜（无边框）/土豆.svg", "vegetable", 0],
            ["v2/通用/蔬菜/蔬菜（无边框）/西兰花_1.svg", "vegetable", 0],
            ["v2/通用/蔬菜/蔬菜（无边框）/小白萝卜.svg", "vegetable", 0],
            ["v2/通用/蔬菜/蔬菜（无边框）/小萝卜_2.svg", "vegetable", 0],
            ["v2/通用/蔬菜/蔬菜（无边框）/洋葱.svg", "vegetable", 0],
            ["v2/通用/蔬菜/蔬菜（无边框）/玉米_1.svg", "vegetable", 0],
            ["v2/通用/蔬菜/蔬菜（无边框）/指天椒_1.svg", "vegetable", 0],


        ]

        return images_fruit_url,images_vegetable_url


    def FlyAndSwimAndRun(self):
        images_fly_url=[
            ["v2/通用/动物/6_特殊类别_蝴蝶/蝴蝶_F1.svg", "fly", 0],
            ["v2/通用/动物/6_特殊类别_蝴蝶/蝴蝶_R1.svg", "fly", 0],
            ["v2/通用/动物/1-动物基础分类/鸟类动物/小鸟组合_1组/小鸟_L1.svg", "fly", 0],
            ["v2/通用/动物/2-特殊分类-能飞的/蜜蜂_L1.svg", "fly", 0],
            ["v2/通用/动物/2-特殊分类-能飞的/鸟_R1.svg", "fly", 0],
            ["v2/通用/动物/2-特殊分类-能飞的/鸟_R5.svg", "fly", 0],
            ["v2/通用/动物/2-特殊分类-能飞的/蜻蜓_F1.svg", "fly", 0],
        ]

        images_swim_url=[
            ["v2/通用/动物/3-特殊分类_能游的/海马_L1.svg", "swim", 1],
            ["v2/通用/动物/3-特殊分类_能游的/海豚_L1.svg", "swim", 1],
            ["v2/通用/动物/3-特殊分类_能游的/鲸鱼_F1.svg", "swim", 1],
            ["v2/通用/动物/3-特殊分类_能游的/水母_F1.svg", "swim", 1],
            ["v2/通用/动物/3-特殊分类_能游的/鱼_L1.svg", "swim", 1],
            ["v2/通用/动物/3-特殊分类_能游的/鱼_L2.svg", "swim", 1],
            ["v2/通用/动物/3-特殊分类_能游的/鱼_L3.svg", "swim", 1],
            ["v2/通用/动物/3-特殊分类_能游的/鱼_L4.svg", "swim", 1],
            ["v2/通用/动物/3-特殊分类_能游的/鱼_L6.svg", "swim", 1],
            ["v2/通用/动物/3-特殊分类_能游的/鱼_R2.svg", "swim", 1],

        ]

        images_run_url=[
            ["v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_1组/Left/斑马_L1.svg", "run", 2],
            ["v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_1组/Left/绵羊_L1.svg", "run", 2],
            ["v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_1组/Left/牛_L1.svg", "run", 2],
            ["v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_1组/Right/山羊_R1.svg", "run", 2],
            ["v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_1组/Right/小狗_R1.svg", "run", 2],
            ["v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_1组/Right/猪_R1.svg", "run", 2],
            ["v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_2组/Left/猫_L1.svg", "run", 2],
            ["v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_2组/Left/狮子_L1.svg", "run", 2],
            ["v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_2组/Left/长颈鹿_L1.svg", "run", 2],

        ]

        return images_fly_url,images_swim_url,images_run_url

    def ToyAndStationeryEC(self):
        images_toy_url=[
            ["v2/通用/玩具/叠叠乐_1.svg","toy"],
            ["v2/通用/玩具/风车.svg","toy"],
            ["v2/通用/玩具/玩具翻斗车_1.svg","toy"],
            ["v2/通用/玩具/玩具飞机_1.svg","toy"],
            ["v2/通用/玩具/玩具飞机_2.svg","toy"],
            ["v2/通用/玩具/玩具火车_1.svg","toy"],
            ["v2/通用/玩具/玩具火箭.svg","toy"],
            ["v2/通用/玩具/玩具机器人.svg","toy"],
            ["v2/通用/玩具/玩具积木.svg","toy"],
            ["v2/通用/玩具/玩具铃铛.svg","toy"],
            ["v2/通用/玩具/玩具枪手.svg","toy"],
            ["v2/通用/玩具/玩具手柄.svg","toy"],
            ["v2/通用/玩具/玩具陀螺.svg","toy"],
            ["v2/通用/玩具/玩具娃娃.svg","toy"],
            ["v2/通用/玩具/玩具小车_1.svg","toy"],
            ["v2/通用/玩具/玩具小车_2.svg","toy"],
            ["v2/通用/玩具/玩具小熊_1.svg","toy"],

        ]

        images_stationery_url=[
            ["v2/通用/文具/文具组合1/笔1.svg", "stationery"],
            ["v2/通用/文具/文具组合1/笔2.svg", "stationery"],
            ["v2/通用/文具/文具组合1/笔3.svg", "stationery"],
            ["v2/通用/文具/文具组合1/笔4.svg", "stationery"],
            ["v2/通用/文具/文具组合1/尺子.svg", "stationery"],
            ["v2/通用/文具/文具组合1/钢笔.svg", "stationery"],
            ["v2/通用/文具/文具组合1/铅笔_3.svg", "stationery"],
            ["v2/通用/文具/文具组合1/圆珠笔.svg", "stationery"],
            ["v2/通用/文具/文具组合2/卷笔刀.svg", "stationery"],

        ]

        images_clothing_url=[
            ["v2/通用/服饰/服装/polo_1.svg", "clothing"],
            ["v2/通用/服饰/服装/polo_2.svg", "clothing"],
            ["v2/通用/服饰/服装/T恤_1.svg", "clothing"],
            ["v2/通用/服饰/服装/T恤_2.svg", "clothing"],
            ["v2/通用/服饰/服装/T恤_3.svg", "clothing"],
            ["v2/通用/服饰/服装/T恤_4.svg", "clothing"],
            ["v2/通用/服饰/服装/衬衫.svg", "clothing"],
            ["v2/通用/服饰/服装/短裤_1.svg", "clothing"],
            ["v2/通用/服饰/服装/夹克.svg", "clothing"],
            ["v2/通用/服饰/服装/连衣裙_1.svg", "clothing"],
            ["v2/通用/服饰/服装/连衣裙_2.svg", "clothing"],
            ["v2/通用/服饰/服装/帽衫.svg", "clothing"],
            ["v2/通用/服饰/服装/袜子_1.svg", "clothing"],
            ["v2/通用/服饰/服装/袜子_2.svg", "clothing"],
            ["v2/通用/服饰/服装/长裤_1.svg", "clothing"],

        ]




        images_sportEquipment_url=[

            ["v2/通用/体育/棒球.svg", "sportEquipment"],
            ["v2/通用/体育/棒球棍.svg", "sportEquipment"],
            ["v2/通用/体育/橄榄球.svg", "sportEquipment"],
            ["v2/通用/体育/毽子.svg", "sportEquipment"],
            ["v2/通用/体育/篮球.svg", "sportEquipment"],
            ["v2/通用/体育/乒乓球拍.svg", "sportEquipment"],
            ["v2/通用/体育/跳绳.svg", "sportEquipment"],
            ["v2/通用/体育/网球拍1.svg", "sportEquipment"],
            ["v2/通用/体育/羽毛球.svg", "sportEquipment"],
            ["v2/通用/体育/桌球.svg", "sportEquipment"],
            ["v2/通用/体育/足球.svg", "sportEquipment"],
            ["v2/通用/体育/网球.svg", "sportEquipment"],

        ]

        return images_toy_url,images_stationery_url,images_clothing_url,images_sportEquipment_url

    def EquationClassify(self):
        One=[
            ["1+0=",1],
            ["6-2-3=",1],
            ["9-8=",1],
            ["7-6=",1],
            ["9-3-5=",1],
        ]

        Two = [
            ["2+0=", 2],
            ["6-4=", 2],
            ["8-6=", 2],
            ["9-1-6=", 2],
            ["5-1-2=", 2],
        ]
        Thire = [
            ["3+0=", 3],
            ["2+1=", 3],
            ["4-1=", 3],
            ["9-2-4=", 3],
            ["7-1-3=", 3],
        ]
        Four = [
            ["4+0=", 4],
            ["2+1+1=", 4],
            ["7-2-1=", 4],
            ["8-2-2=", 4],
            ["2+2=", 4],
        ]
        Fif = [
            ["5+0=", 5],
            ["4+1=", 5],
            ["3+2=", 5],
            ["2+3=", 5],
            ["1+1+3=", 5],
            ["1+2+2=", 5],
            ["8-1-2=", 5],
        ]
        Six = [
            ["1+5=", 6],
            ["2+4=", 6],
            ["3+3=", 6],
            ["1+1+4=", 6],
            ["2+2+2=", 6],
            ["2+1+3=", 6],
            ["1+4+1=", 6],
            ["9-1-2=", 6],

        ]
        Seven = [
            ["1+6=", 7],
            ["2+5=", 7],
            ["3+4=", 7],
            ["1+2+4=", 7],
            ["1+6+1=", 7],
            ["2+3+2=", 7],
            ["9-1-1=", 7],
        ]
        Eight = [
            ["1+7=", 8],
            ["2+6=", 8],
            ["3+5=", 8],
            ["4+4=", 8],
            ["2+3+3=", 8],
            ["1+2+5=", 8],
            ["4+1+3=", 8],
        ]
        Nine = [
            ["1+8=", 9],
            ["2+7=", 9],
            ["3+6=", 9],
            ["4+5=", 9],
            ["2+2+5=", 9],
            ["1+3+5=", 9],
            ["4+1+4=", 9],
        ]

        return One,Two,Thire,Four,Fif,Six,Seven,Eight,Nine

    def CalculationClssify(self):
        One = [
            ["1+0", 1],
            ["5-4", 1],
            ["9-8", 1],
            ["7-6", 1],

        ]

        Two = [
            ["2+0", 2],
            ["6-4", 2],
            ["8-6", 2],
            ["5-3", 2],

        ]
        Thire = [
            ["3+0", 3],
            ["2+1", 3],
            ["4-1", 3],
            ["9-6", 3],

        ]
        Four = [
            ["4+0", 4],
            ["1+3", 4],
            ["3+1", 4],
            ["2+2", 4],
        ]
        Fif = [
            ["5+0", 5],
            ["4+1", 5],
            ["3+2", 5],
            ["2+3", 5],

        ]
        Six = [
            ["1+5", 6],
            ["2+4", 6],
            ["3+3", 6],
            ["9-3", 6],


        ]
        Seven = [
            ["1+6", 7],
            ["2+5", 7],
            ["3+4", 7],
            ["9-2", 7],

        ]
        Eight = [
            ["1+7", 8],
            ["2+6", 8],
            ["3+5", 8],
            ["4+4", 8],

        ]
        Nine = [
            ["1+8", 9],
            ["2+7", 9],
            ["3+6", 9],
            ["4+5", 9],

        ]

        return One, Two, Thire, Four, Fif, Six, Seven, Eight, Nine


    def Transport(self):

        transport_fly_url=[
            ["v2/通用/交通/飞机/飞机_1.svg", "fly"],
            ["v2/通用/交通/飞机/飞机_2.svg", "fly"],
            ["v2/通用/交通/飞机/飞机_3.svg", "fly"],
            ["v2/通用/交通/飞机/飞机_4.svg", "fly"],
            ["v2/通用/交通/飞机/飞机_5.svg", "fly"],
            ["v2/通用/交通/飞机/飞机_6.svg", "fly"],
            ["v2/通用/交通/飞机/飞机_7.svg", "fly"],
            ["v2/通用/交通/飞机/飞机_8.svg", "fly"],
            ["v2/通用/交通/飞机/飞机_9.svg", "fly"],
            ["v2/通用/交通/飞机/飞机_10.svg", "fly"]
        ]

        transport_land_url=[

            ["v2/通用/交通/背景用车/车_1.svg", "land"],
            ["v2/通用/交通/背景用车/车_2.svg", "land"],
            ["v2/通用/交通/背景用车/车_3.svg", "land"],
            ["v2/通用/交通/背景用车/车_4.svg", "land"],
            ["v2/通用/交通/背景用车/车_5.svg", "land"],
            ["v2/通用/交通/车辆/卡车_1.svg", "land"],
            ["v2/通用/交通/车辆/卡车_2.svg", "land"],
            ["v2/通用/交通/车辆/卡车_3.svg", "land"],
            ["v2/通用/交通/车辆/卡车_4.svg", "land"],
            ["v2/通用/交通/车辆/卡车_5.svg", "land"],
            ["v2/通用/交通/车辆/卡车_6.svg", "land"],
            ["v2/通用/交通/车辆/自行车/自行车1.svg", "land"],
            ["v2/通用/交通/车辆/自行车/自行车2.svg", "land"],
            ["v2/通用/交通/车辆/自行车/自行车3.svg", "land"],
            ["v2/通用/交通/车辆/自行车/自行车4.svg", "land"],
            ["v2/通用/交通/车辆/自行车/自行车5.svg", "land"],
            ["v2/通用/交通/火车/火车_1.svg", "land"],
            ["v2/通用/交通/火车/火车_2.svg", "land"],
            ["v2/通用/交通/火车/火车_3.svg", "land"],

        ]

        transport_steamer_url=[

            ["v2/通用/交通/轮船/货船_1.svg", "swim"],
            ["v2/通用/交通/轮船/货船_2.svg", "swim"],
            ["v2/通用/交通/轮船/小船_1.svg", "swim"],
            ["v2/通用/交通/轮船/小船_2.svg", "swim"],
            ["v2/通用/交通/轮船/小船_3.svg", "swim"],
            ["v2/通用/交通/轮船/小船_4.svg", "swim"],
            ["v2/通用/交通/轮船/小船_5.svg", "swim"],
            ["v2/通用/交通/轮船/游轮_1.svg", "swim"],
            ["v2/通用/交通/轮船/游艇_1.svg", "swim"],


        ]

        return transport_fly_url,transport_land_url,transport_steamer_url

    def Clothingclssify(self):


        images_orb_url=[
            ["v2/通用/生活中的几何体/球体/篮球.svg", "orb", "球体"],
            ["v2/通用/生活中的几何体/球体/排球.svg", "orb", "球体"],
            ["v2/通用/生活中的几何体/球体/皮球.svg", "orb", "球体"],
            ["v2/通用/生活中的几何体/球体/足球.svg", "orb", "球体"],
            ["v2/通用/生活中的几何体/球体/桌球.svg", "orb", "球体"],
            ]

        images_hat_url=[
            ["v2/通用/服饰/饰品/帽子/帽子_1.svg", "hat"],
            ["v2/通用/服饰/饰品/帽子/帽子_2.svg", "hat"],
            ["v2/通用/服饰/饰品/帽子/帽子_3.svg", "hat"],
            ["v2/通用/服饰/饰品/帽子/帽子_4.svg", "hat"],
            ["v2/通用/服饰/饰品/帽子/帽子_5.svg", "hat"],
        ]

        images_shoes_url=[

            ["v2/通用/鞋靴/鞋子_1.svg", "shoes"],
            ["v2/通用/鞋靴/鞋子_2.svg", "shoes"],
            ["v2/通用/鞋靴/鞋子_3.svg", "shoes"],


        ]

        images_surface_url=[
            ["v2/通用/服饰/饰品/手表_1.svg", "surface"],
            ["v2/通用/服饰/饰品/手表_2.svg", "surface"],
            ["v2/通用/服饰/饰品/手表_3.svg", "surface"],
            ["v2/通用/服饰/饰品/手表_4.svg", "surface"],

        ]

        images_skirt_url=[

            ["v2/通用/服饰/服装/连衣裙_1.svg", "skirt"],
            ["v2/通用/服饰/服装/连衣裙_2.svg", "skirt"],
            ["v2/通用/服饰/服装/半裙组合_2/紫色裙子2.svg", "skirt"],
            ["v2/通用/服饰/服装/短裙组合_1/短裙_1.svg", "skirt"],
            ["v2/通用/服饰/服装/短裙组合_1/短裙_2.svg", "skirt"]

        ]

        return images_hat_url,images_surface_url,images_skirt_url,images_orb_url,images_shoes_url


    def ClassifyTintage(self):
        images_stationery_url=[
            ["v2/组件/分类与整理/1-4-2-2/无色线描钢笔.svg", "v2/组件/分类与整理/1-4-2-2/红色填色钢笔.svg","v2/组件/分类与整理/1-4-2-2/蓝色填色钢笔.svg","v2/组件/分类与整理/1-4-2-2/黄色填色钢笔.svg",
             "v2/组件/分类与整理/1-4-2-2/红色线描钢笔.svg","v2/组件/分类与整理/1-4-2-2/蓝色线描钢笔.svg","v2/组件/分类与整理/1-4-2-2/黄色线描钢笔.svg","stationery","red"],
            ["v2/组件/分类与整理/1-4-2-2/无色线描铅笔.svg", "v2/组件/分类与整理/1-4-2-2/红色填色铅笔.svg", "v2/组件/分类与整理/1-4-2-2/蓝色填色铅笔.svg",
             "v2/组件/分类与整理/1-4-2-2/黄色填色铅笔.svg", "v2/组件/分类与整理/1-4-2-2/红色线描铅笔.svg", "v2/组件/分类与整理/1-4-2-2/蓝色线描铅笔.svg", "v2/组件/分类与整理/1-4-2-2/黄色线描铅笔.svg",
             "stationery","red"],
            ["v2/组件/分类与整理/1-4-2-2/无色线描圆珠笔.svg", "v2/组件/分类与整理/1-4-2-2/红色填色圆珠笔.svg", "v2/组件/分类与整理/1-4-2-2/蓝色填色圆珠笔.svg",
             "v2/组件/分类与整理/1-4-2-2/黄色填色圆珠笔.svg", "v2/组件/分类与整理/1-4-2-2/红色线描圆珠笔.svg", "v2/组件/分类与整理/1-4-2-2/蓝色线描圆珠笔.svg",
             "v2/组件/分类与整理/1-4-2-2/黄色线描圆珠笔.svg",
             "stationery","red"],
        ]

        images_fruit_url=[
            ["v2/组件/分类与整理/1-4-2-2/无色线描桔.svg", "v2/组件/分类与整理/1-4-2-2/红色填色桔.svg", "v2/组件/分类与整理/1-4-2-2/蓝色填色桔.svg",
             "v2/组件/分类与整理/1-4-2-2/黄色填色桔.svg", "v2/组件/分类与整理/1-4-2-2/红色线描桔.svg", "v2/组件/分类与整理/1-4-2-2/蓝色线描桔.svg",
             "v2/组件/分类与整理/1-4-2-2/黄色线描桔.svg",
             "fruit","blue"],
            ["v2/组件/分类与整理/1-4-2-2/无色线描梨.svg", "v2/组件/分类与整理/1-4-2-2/红色填色梨.svg", "v2/组件/分类与整理/1-4-2-2/蓝色填色梨.svg",
             "v2/组件/分类与整理/1-4-2-2/黄色填色梨.svg", "v2/组件/分类与整理/1-4-2-2/红色线描梨.svg", "v2/组件/分类与整理/1-4-2-2/蓝色线描梨.svg",
             "v2/组件/分类与整理/1-4-2-2/黄色线描梨.svg",
             "fruit","blue"],
            ["v2/组件/分类与整理/1-4-2-2/无色线描苹果.svg", "v2/组件/分类与整理/1-4-2-2/红色填色苹果.svg", "v2/组件/分类与整理/1-4-2-2/蓝色填色苹果.svg",
             "v2/组件/分类与整理/1-4-2-2/黄色填色苹果.svg", "v2/组件/分类与整理/1-4-2-2/红色线描苹果.svg", "v2/组件/分类与整理/1-4-2-2/蓝色线描苹果.svg",
             "v2/组件/分类与整理/1-4-2-2/黄色线描苹果.svg",
             "fruit","blue"],

        ]

        images_animal_url=[
            ["v2/组件/分类与整理/1-4-2-2/无色线描鸡.svg","v2/组件/分类与整理/1-4-2-2/红色填色鸡.svg", "v2/组件/分类与整理/1-4-2-2/蓝色填色鸡.svg",
             "v2/组件/分类与整理/1-4-2-2/黄色填色鸡.svg", "v2/组件/分类与整理/1-4-2-2/红色线描鸡.svg", "v2/组件/分类与整理/1-4-2-2/蓝色线描鸡.svg",
             "v2/组件/分类与整理/1-4-2-2/黄色线描鸡.svg",
             "animal","yellow"],
            ["v2/组件/分类与整理/1-4-2-2/无色线描猫.svg", "v2/组件/分类与整理/1-4-2-2/红色填色猫.svg", "v2/组件/分类与整理/1-4-2-2/蓝色填色猫.svg",
             "v2/组件/分类与整理/1-4-2-2/黄色填色猫.svg", "v2/组件/分类与整理/1-4-2-2/红色线描猫.svg", "v2/组件/分类与整理/1-4-2-2/蓝色线描猫.svg",
             "v2/组件/分类与整理/1-4-2-2/黄色线描猫.svg",
             "animal","yellow"],
            ["v2/组件/分类与整理/1-4-2-2/无色线描松鼠.svg", "v2/组件/分类与整理/1-4-2-2/红色填色松鼠.svg", "v2/组件/分类与整理/1-4-2-2/蓝色填色松鼠.svg",
             "v2/组件/分类与整理/1-4-2-2/黄色填色松鼠.svg", "v2/组件/分类与整理/1-4-2-2/红色线描松鼠.svg", "v2/组件/分类与整理/1-4-2-2/蓝色线描松鼠.svg",
             "v2/组件/分类与整理/1-4-2-2/黄色线描松鼠.svg",
             "animal","yellow"],

        ]

        images_brush_url=[
            ["v2/组件/分类与整理/1-4-2-2/红色刷子.svg","red"],
            ["v2/组件/分类与整理/1-4-2-2/蓝色刷子.svg","blue"],
            ["v2/组件/分类与整理/1-4-2-2/黄色刷子.svg","yellow"],
        ]

        return images_stationery_url,images_fruit_url,images_animal_url,images_brush_url

    def FruitShape(self):
        images_fruit_url=[
            ["v2/通用/水果/菠萝.svg", "pineapple"],
            ["v2/通用/水果/草莓_1.svg", "strawberry"],
            ["v2/通用/水果/黄苹果.svg", "apple"],
            ["v2/通用/水果/桔子_1.svg", "orange"],
            ["v2/通用/水果/开口香蕉_1.svg", "banana"],
            ["v2/通用/水果/蓝莓.svg", "blueberry"],
            ["v2/通用/水果/梨.svg", "pear"],
            ["v2/通用/水果/芒果.svg", "mango"],
            ["v2/通用/水果/柠檬.svg", "lemon"],
            ["v2/通用/水果/桃子.svg", "peach"],
            ["v2/通用/水果/西瓜_1.svg", "watermelon"],

        ]

        return images_fruit_url

    def CubeDiscern(self):
        images_cube_url=[

            ["v2/通用/基本立体图形/正方体_1.svg", "cube","正方体"],
            ["v2/通用/基本立体图形/正方体_6.svg", "cube","正方体"],
            ["v2/通用/基本立体图形/正方体_5.svg", "cube","正方体"],
            ["v2/通用/基本立体图形/正方体_黄色.svg", "cube","正方体"],
            ["v2/通用/基本立体图形/正方体2_黄色.svg", "cube","正方体"],
            ["v2/通用/基本立体图形/正方体2_蓝色.svg", "cube","正方体"],

        ]

        images_solid_url=[

            ["v2/通用/基本立体图形/球体_2.svg", "globe", "球体"],
            ["v2/通用/基本立体图形/球体_3.svg", "globe", "球体"],
            ["v2/通用/基本立体图形/球体_4.svg", "globe", "球体"],
            ["v2/通用/基本立体图形/球体_5.svg", "globe", "球体"],
            ["v2/通用/基本立体图形/圆柱体_2.svg", "cylinder", "圆柱体"],
            ["v2/通用/基本立体图形/圆柱体_3.svg", "cylinder", "圆柱体"],
            ["v2/通用/基本立体图形/长方体_2.svg", "cuboid", "长方体"],
            ["v2/通用/基本立体图形/长方体_3.svg", "cuboid", "长方体"],
            ["v2/通用/基本立体图形/长方体_4.svg", "cuboid", "长方体"],
            ["v2/通用/基本立体图形/长方体_5.svg", "cuboid", "长方体"],

        ]




        return images_cube_url,images_solid_url

    def CubeShape(self):

        images_cube_url=[
            ["v2/通用/基本立体图形/正方体_1.svg", "cube", "正方体"],
            ["v2/通用/基本立体图形/正方体_2.svg", "cube", "正方体"],
            ["v2/通用/基本立体图形/正方体_3.svg", "cube", "正方体"],
        ]

        other_solid_url=[
            ["v2/通用/基本立体图形/球体_2.svg", "globe", "球体"],
            ["v2/通用/基本立体图形/球体_3.svg", "globe", "球体"],
            ["v2/通用/基本立体图形/球体_4.svg", "globe", "球体"],
            ["v2/通用/基本立体图形/球体_5.svg", "globe", "球体"],
            ["v2/通用/基本立体图形/圆柱体_3.svg", "cylinder", "圆柱体"],
            ["v2/通用/基本立体图形/长方体_2.svg", "cuboid", "长方体"],
            ["v2/通用/基本立体图形/长方体_3.svg", "cuboid", "长方体"],
            ["v2/通用/基本立体图形/长方体_4.svg", "cuboid", "长方体"],
            ["v2/通用/基本立体图形/长方体_5.svg", "cuboid", "长方体"],

        ]

        return images_cube_url,other_solid_url

    def CuboidShape(self):

        images_cuboid_url=[
            ["v2/通用/基本立体图形/长方体_2.svg", "cuboid", "长方体"],
            ["v2/通用/基本立体图形/长方体_3.svg", "cuboid", "长方体"],
            ["v2/通用/基本立体图形/长方体_4.svg", "cuboid", "长方体"],
            ["v2/通用/基本立体图形/长方体_5.svg", "cuboid", "长方体"],

        ]

        other_solid_url=[
            ["v2/通用/基本立体图形/球体_2.svg", "globe", "球体"],
            ["v2/通用/基本立体图形/球体_3.svg", "globe", "球体"],
            ["v2/通用/基本立体图形/球体_4.svg", "globe", "球体"],
            ["v2/通用/基本立体图形/球体_5.svg", "globe", "球体"],
            ["v2/通用/基本立体图形/圆柱体_3.svg", "cylinder", "圆柱体"],
            ["v2/通用/基本立体图形/正方体_1.svg", "cube", "正方体"],
            ["v2/通用/基本立体图形/正方体_2.svg", "cube", "正方体"],
            ["v2/通用/基本立体图形/正方体_3.svg", "cube", "正方体"],

        ]

        return images_cuboid_url,other_solid_url

    def ChinaDescriptionSolid(self):
        all_solid_list=["正方体","长方体","圆锥","球体"]
        images_cuboid_url=[
            ["v2/通用/基本立体图形/长方体_2.svg", "cuboid", "长方体"],
            ["v2/通用/基本立体图形/长方体_3.svg", "cuboid", "长方体"],
            ["v2/通用/基本立体图形/长方体_4.svg", "cuboid", "长方体"],
            ["v2/通用/基本立体图形/长方体_5.svg", "cuboid", "长方体"],
        ]

        return all_solid_list,images_cuboid_url

    def LifeSolid(self):
        life_cube_url=[
            ["v2/通用/生活中的几何体/正方体/菜篮子.svg", "cube", "正方体"],
            ["v2/通用/生活中的几何体/正方体/积木_1.svg", "cube", "正方体"],
            ["v2/通用/生活中的几何体/正方体/积木_2.svg", "cube", "正方体"],
            ["v2/通用/生活中的几何体/正方体/积木_3.svg", "cube", "正方体"],
            ["v2/通用/生活中的几何体/正方体/魔方.svg", "cube", "正方体"],
            ["v2/通用/生活中的几何体/正方体/筛子.svg", "cube", "正方体"],
            ["v2/通用/生活中的几何体/正方体/时钟.svg", "cube", "正方体"],
            ["v2/通用/生活中的几何体/正方体/箱子.svg", "cube", "正方体"],
            ["v2/通用/生活中的几何体/正方体/字母.svg", "cube", "正方体"],
        ]

        life_cuboid_url=[
            ["v2/通用/生活中的几何体/长方体/保险箱.svg", "cuboid", "长方体"],
            ["v2/通用/生活中的几何体/长方体/冰箱.svg", "cuboid", "长方体"],
            ["v2/通用/生活中的几何体/长方体/饼干盒.svg", "cuboid", "长方体"],
            ["v2/通用/生活中的几何体/长方体/柜子_1.svg", "cuboid", "长方体"],
            ["v2/通用/生活中的几何体/长方体/柜子_2.svg", "cuboid", "长方体"],
            ["v2/通用/生活中的几何体/长方体/盒子_1.svg", "cuboid", "长方体"],
            ["v2/通用/生活中的几何体/长方体/门.svg", "cuboid", "长方体"],
            ["v2/通用/生活中的几何体/长方体/皮箱 .svg", "cuboid", "长方体"],
            ["v2/通用/生活中的几何体/长方体/日历.svg", "cuboid", "长方体"],
            ["v2/通用/生活中的几何体/长方体/手机.svg", "cuboid", "长方体"],
            ["v2/通用/生活中的几何体/长方体/书本_1.svg", "cuboid", "长方体"],
            ["v2/通用/生活中的几何体/长方体/微波炉.svg", "cuboid", "长方体"],
            ["v2/通用/生活中的几何体/长方体/箱子_2.svg", "cuboid", "长方体"],
            ["v2/通用/生活中的几何体/长方体/音响.svg", "cuboid", "长方体"],

        ]

        life_globe_url=[
            ["v2/通用/生活中的几何体/球体/棒球.svg", "orb", "球体"],
            ["v2/通用/生活中的几何体/球体/玻璃球.svg", "orb", "球体"],
            ["v2/通用/生活中的几何体/球体/地球.svg", "orb", "球体"],
            ["v2/通用/生活中的几何体/球体/篮球.svg", "orb", "球体"],
            ["v2/通用/生活中的几何体/球体/排球.svg", "orb", "球体"],
            ["v2/通用/生活中的几何体/球体/皮球.svg", "orb", "球体"],
            ["v2/通用/生活中的几何体/球体/足球.svg", "orb", "球体"],
            ["v2/通用/生活中的几何体/球体/桌球.svg", "orb", "球体"],
            ["v2/通用/生活中的几何体/球体/鱼缸.svg", "orb", "球体"],
        ]

        life_cylinder_url=[
            ["v2/通用/生活中的几何体/圆柱体/蛋糕.svg", "cylinder", "圆柱体"],
            ["v2/通用/生活中的几何体/圆柱体/胶水.svg", "cylinder", "圆柱体"],
            ["v2/通用/生活中的几何体/圆柱体/皮鼓.svg", "cylinder", "圆柱体"],
            ["v2/通用/生活中的几何体/圆柱体/汽水瓶.svg", "cylinder", "圆柱体"],
            ["v2/通用/生活中的几何体/圆柱体/铅笔_1.svg", "cylinder", "圆柱体"],
            ["v2/通用/生活中的几何体/圆柱体/铅笔_2.svg", "cylinder", "圆柱体"],
            ["v2/通用/生活中的几何体/圆柱体/烧杯_1.svg", "cylinder", "圆柱体"],
            ["v2/通用/生活中的几何体/圆柱体/烧杯_2.svg", "cylinder", "圆柱体"],
            ["v2/通用/生活中的几何体/圆柱体/手电筒_1.svg", "cylinder", "圆柱体"],
            ["v2/通用/生活中的几何体/圆柱体/手电筒_2.svg", "cylinder", "圆柱体"],
            ["v2/通用/生活中的几何体/圆柱体/寿司_1.svg", "cylinder", "圆柱体"],
            ["v2/通用/生活中的几何体/圆柱体/饮料瓶.svg", "cylinder", "圆柱体"],
            ["v2/通用/生活中的几何体/圆柱体/油笔棒.svg", "cylinder", "圆柱体"],
            ["v2/通用/生活中的几何体/圆柱体/瑜伽垫.svg", "cylinder", "圆柱体"],

        ]

        return life_cube_url,life_cuboid_url,life_globe_url,life_cylinder_url

    def CylinderShape(self):
        all_solid_list = ["圆柱体", "长方体", "圆锥", "球体"]
        images_cylinder_url=[
            ["v2/通用/基本立体图形/圆柱体_3.svg", "cylinder", "圆柱体"],
            ["v2/通用/基本立体图形/圆柱体_1.svg", "cylinder", "圆柱体"],
        ]
        return all_solid_list,images_cylinder_url

    def CylinderShapeDiscern(self):
        all_solid_list = [
            ["v2/通用/基本立体图形/球体_2.svg", "globe", "球体"],
            ["v2/通用/基本立体图形/球体_3.svg", "globe", "球体"],
            ["v2/通用/基本立体图形/球体_4.svg", "globe", "球体"],
            ["v2/通用/基本立体图形/球体_5.svg", "globe", "球体"],
            ["v2/通用/基本立体图形/正方体_2.svg", "cube", "正方体"],
            ["v2/通用/基本立体图形/长方体_2.svg", "cuboid", "长方体"],
            ["v2/通用/基本立体图形/长方体_3.svg", "cuboid", "长方体"],
            ["v2/通用/基本立体图形/长方体_4.svg", "cuboid", "长方体"],
            ["v2/通用/基本立体图形/长方体_5.svg", "cuboid", "长方体"],

        ]
        images_cylinder_url = [
            ["v2/通用/基本立体图形/圆柱体_3.svg", "cylinder", "圆柱体"],
            ["v2/通用/基本立体图形/圆柱体_1.svg", "cylinder", "圆柱体"],
        ]
        return all_solid_list, images_cylinder_url

    def GlobeShape(self):
        all_solid_list = [
            ["v2/通用/基本立体图形/圆柱体_3.svg", "cylinder", "圆柱体"],
            ["v2/通用/基本立体图形/圆柱体_1.svg", "cylinder", "圆柱体"],
            ["v2/通用/基本立体图形/正方体_2.svg", "cube", "正方体"],
            ["v2/通用/基本立体图形/长方体_2.svg", "cuboid", "长方体"],
            ["v2/通用/基本立体图形/长方体_3.svg", "cuboid", "长方体"],
            ["v2/通用/基本立体图形/长方体_4.svg", "cuboid", "长方体"],
            ["v2/通用/基本立体图形/长方体_5.svg", "cuboid", "长方体"],

        ]
        images_globe_url = [
            ["v2/通用/基本立体图形/球体_2.svg", "globe", "球体"],
            ["v2/通用/基本立体图形/球体_3.svg", "globe", "球体"],
            ["v2/通用/基本立体图形/球体_4.svg", "globe", "球体"],
            ["v2/通用/基本立体图形/球体_5.svg", "globe", "球体"],

        ]
        return all_solid_list, images_globe_url


    def RollDiagram(self):
        maybe_roll_url=[
            ["v2/通用/基本立体图形/圆柱体_3.svg", "cylinder", "圆柱体"],
            ["v2/通用/基本立体图形/圆柱体_1.svg", "cylinder", "圆柱体"],
            ["v2/通用/基本立体图形/圆柱体-5.svg", "cylinder", "圆柱体"],
            ["v2/通用/基本立体图形/圆柱体_蓝色.svg", "cylinder", "圆柱体"],
            ["v2/通用/基本立体图形/圆柱体_黄色.svg", "cylinder", "圆柱体"],
            ["v2/通用/基本立体图形/球体_2.svg", "orb", "球体"],
            ["v2/通用/基本立体图形/球体_3.svg", "orb", "球体"],
            ["v2/通用/基本立体图形/球体_4.svg", "orb", "球体"],
            ["v2/通用/基本立体图形/球体_5.svg", "orb", "球体"],

        ]
        not_roll_url=[
            ["v2/通用/基本立体图形/正方体_2.svg", "cube", "正方体"],
            ["v2/通用/基本立体图形/正方体_6.svg", "cube", "正方体"],
            ["v2/通用/基本立体图形/正方体_黄色.svg", "cube", "正方体"],
            ["v2/通用/基本立体图形/正方体_蓝色.svg", "cube", "正方体"],
            ["v2/通用/基本立体图形/长方体_2.svg", "cuboid", "长方体"],
            ["v2/通用/基本立体图形/长方体_3.svg", "cuboid", "长方体"],
            ["v2/通用/基本立体图形/长方体_4.svg", "cuboid", "长方体"],
            ["v2/通用/基本立体图形/长方体_5.svg", "cuboid", "长方体"],
            ["v2/通用/基本立体图形/长方体_黄色.svg", "cuboid", "长方体"],
            ["v2/通用/基本立体图形/长方体_蓝色.svg", "cuboid", "长方体"],
        ]
        return maybe_roll_url,not_roll_url




    def CuboidDiscern(self):
        images_cuboid_url = [

            ["v2/通用/基本立体图形/正方体线条_1.svg", "cube", "正方体","v2/通用/基本立体图形/正方体_蓝色.svg","v2/通用/基本立体图形/正方体_黄色.svg"],
            ["v2/通用/基本立体图形/正方体线条_2.svg", "cube", "正方体","v2/通用/基本立体图形/正方体2_蓝色.svg","v2/通用/基本立体图形/正方体2_黄色.svg"],
            ["v2/通用/基本平面图形/圆线条_1.svg", "orb", "球体","v2/通用/基本立体图形/圆形_蓝色.svg","v2/通用/基本立体图形/圆形_黄色.svg"],
            ["v2/通用/基本立体图形/圆柱体线条_1.svg", "cylinder", "圆柱体","v2/通用/基本立体图形/圆柱体_蓝色.svg","v2/通用/基本立体图形/圆柱体_黄色.svg"],
            ["v2/通用/基本立体图形/长方体线条_1.svg", "cuboid", "长方体","v2/通用/基本立体图形/长方体_蓝色.svg","v2/通用/基本立体图形/长方体_黄色.svg"],
        ]



        return images_cuboid_url

    def OrbDiscern(self):
        images_orb_url = [

            ["v2/通用/基本立体图形/正方体线条_1.svg", "cube", "正方体"],
            ["v2/通用/基本立体图形/正方体线条_2.svg", "cube", "正方体"],
            ["v2/通用/基本平面图形/圆线条_1.svg", "orb", "球体"],
            ["v2/通用/基本立体图形/圆柱体线条_1.svg", "cylinder", "圆柱体"],
            ["v2/通用/基本立体图形/圆柱体线条_2.svg", "cylinder", "圆柱体"],
            ["v2/通用/基本立体图形/圆柱体线条_3.svg", "cylinder", "圆柱体"],
            ["v2/通用/基本立体图形/长方体线条_1.svg", "cuboid", "长方体"],
            ["v2/通用/基本立体图形/长方体线条_2.svg", "cuboid", "长方体"],


        ]

        return images_orb_url

     #复杂立体组合  [orb,cylinder,cube,cuboid]
    def ComplexStereoCombination(self):

        stereo_combination_url=[
            ["v2/通用/立体图形组合/立体图形组合-数一数/组合立体图形 数一数 1,1,5,4.svg", [4,5,1,1]],
            ["v2/通用/立体图形组合/立体图形组合-数一数/组合立体图形 数一数 1,3,4,1.svg", [1,4,3,1]],
            ["v2/通用/立体图形组合/立体图形组合-数一数/组合立体图形 数一数 1,4,4,2.svg", [2,4,4,1]],
            ["v2/通用/立体图形组合/立体图形组合-数一数/组合立体图形 数一数 2,3,2,1.svg", [1,2,3,2]],
            ["v2/通用/立体图形组合/立体图形组合-数一数/组合立体图形 数一数 2,3,2,3.svg", [3,2,3,2]],
            ["v2/通用/立体图形组合/立体图形组合-数一数/组合立体图形 数一数 2,4,4,4.svg", [4,4,4,2]],
            ["v2/通用/立体图形组合/立体图形组合-数一数/组合立体图形 数一数 3,4,3,2.svg", [2,3,4,3]],
            ["v2/通用/立体图形组合/立体图形组合-数一数/组合立体图形 数一数 4,1,2,2.svg", [2,2,1,4]],
            ["v2/通用/立体图形组合/立体图形组合-数一数/组合立体图形 数一数 4,1,4,2.svg", [2,4,1,4]],
            ["v2/通用/立体图形组合/立体图形组合-数一数/组合立体图形 数一数 4,2,4,2.svg", [2,4,2,4]],

        ]

        return stereo_combination_url

    def GiftBox(self):

        images_gift_orb_url=[
            ["v2/通用/生活中的几何体/球体/玻璃球.svg", "orb", "球体"],
            ["v2/通用/生活中的几何体/球体/地球.svg", "orb", "球体"],
            ["v2/通用/生活中的几何体/球体/篮球.svg", "orb", "球体"],
            ["v2/通用/生活中的几何体/球体/皮球.svg", "orb", "球体"],

        ]
        images_gift_cylinder_url=[
            ["v2/通用/生活中的几何体/圆柱体/烧杯_1.svg", "cylinder", "圆柱体"],
            ["v2/通用/生活中的几何体/圆柱体/饮料瓶.svg", "cylinder", "圆柱体"],
            ["v2/通用/生活中的几何体/圆柱体/手电筒_1.svg", "cylinder", "圆柱体"],
            ["v2/通用/生活中的几何体/圆柱体/汽水瓶.svg", "cylinder", "圆柱体"],

        ]
        images_gift_cuboid_url=[
            ["v2/通用/生活中的几何体/长方体/日历.svg", "cuboid", "长方体"],
            ["v2/通用/生活中的几何体/长方体/手机.svg", "cuboid", "长方体"],
            ["v2/通用/生活中的几何体/长方体/书本_1.svg", "cuboid", "长方体"],
            ["v2/通用/生活中的几何体/长方体/文件夹.svg", "cuboid", "长方体"],


        ]


        images_box_url=[

            ["v2/通用/生活中的几何体/正方体/箱子.svg", "cube", "正方体","globe"],
            ["v2/通用/生活中的几何体/长方体/箱子_1.svg", "cuboid", "长方体","min"],
            ["v2/通用/生活中的几何体/长方体/盒子_1.svg", "cuboid", "长方体","max"],

        ]

        return images_gift_orb_url,images_gift_cuboid_url,images_gift_cylinder_url,images_box_url


    def SteadySolid(self):#晃动的  稳定的
        steady_solid_url=[

            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_2.svg", "swaying"],
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_3.svg", "swaying"],
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_5.svg", "swaying"],
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_6.svg", "swaying"],
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_7.svg", "swaying"],
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_9.svg", "swaying"],
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_11.svg", "swaying"],
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_12.svg", "swaying"],
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_15.svg", "swaying"],
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_16.svg", "swaying"],
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_17.svg", "swaying"],

        ]
        swaying_solid_url=[
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_1.svg", "steady"],
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_4.svg", "steady"],
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_8.svg", "steady"],
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_10.svg", "steady"],
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_14.svg", "steady"],


        ]
        return steady_solid_url,swaying_solid_url

    def CombinationDiscern(self):
        combination_solid_url=[
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_2.svg", "swaying",["cylinder","cuboid"]],
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_3.svg", "swaying",["orb","cuboid"]],
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_5.svg", "swaying",["cylinder","cube","cuboid"]],
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_6.svg", "swaying",["cube","cylinder"]],
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_7.svg", "swaying",["cube","orb"]],
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_9.svg", "swaying",["orb","cylinder"]],
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_1.svg", "steady",["cylinder","cuboid"]],
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_4.svg", "steady",["cylinder","cube","cuboid"]],
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_8.svg", "steady",["cylinder","cube"]],
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_10.svg", "steady",["cylinder","cuboid"]],

        ]
        return combination_solid_url


    def CombinationLoation(self):
        swaying_solid_url = [
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_1.svg", "steady",["长方体","圆柱体"]],
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_8.svg", "steady",["圆柱体","正方体"]],
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_10.svg", "steady",["圆柱体","长方体"]],
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_2.svg", "swaying",["圆柱体","长方体"]],
            ["v2/通用/立体图形组合/立体图形组合-稳定性/站稳_3.svg", "swaying",["长方体","球体"]],

        ]

        images_solid_url = [

            ["v2/通用/基本立体图形/正方体_蓝色.svg", "cube", "正方体"],
            ["v2/通用/基本立体图形/球体_3.svg", "orb", "球体"],
            ["v2/通用/基本立体图形/圆柱体_蓝色.svg", "cylinder", "圆柱体"],
            ["v2/通用/基本立体图形/长方体_黄色.svg", "cuboid", "长方体"],


        ]

        return swaying_solid_url,images_solid_url


    def SplitFindCombine(self):
        images_combine_url=[
            ["v2/通用/立体图形组合/立体图形组合_连线/组合1.svg", "v2/通用/立体图形组合/立体图形组合_连线/组合5.svg"],
            ["v2/通用/立体图形组合/立体图形组合_连线/组合2.svg", "v2/通用/立体图形组合/立体图形组合_连线/组合6.svg"],
            ["v2/通用/立体图形组合/立体图形组合_连线/组合3.svg", "v2/通用/立体图形组合/立体图形组合_连线/组合4.svg"],

        ]

        return images_combine_url

    def BrickConstract(self):
        images_brick_url=[
            ["v2/通用/基本立体图形/积木/组合1.svg", "v2/通用/基本立体图形/积木/积木3.svg"],
            ["v2/通用/基本立体图形/积木/组合2.svg", "v2/通用/基本立体图形/积木/积木4.svg"],
            ["v2/通用/基本立体图形/积木/组合3.svg", "v2/通用/基本立体图形/积木/积木10.svg"],
            ["v2/通用/基本立体图形/积木/组合4.svg", "v2/通用/基本立体图形/积木/积木2.svg"],

        ]

        return images_brick_url


    def CombineFindSplit(self):

        images_brick_url=[
            ["v2/通用/基本立体图形/积木/积木5.svg", "v2/通用/基本立体图形/积木/积木7.svg","v2/通用/基本立体图形/积木/积木11.svg"],
            ["v2/通用/基本立体图形/积木/积木5.svg", "v2/通用/基本立体图形/积木/积木6.svg","v2/通用/基本立体图形/积木/积木9.svg"],
            ["v2/通用/基本立体图形/积木/积木5.svg", "v2/通用/基本立体图形/积木/积木8.svg","v2/通用/基本立体图形/积木/积木1.svg"],

        ]

        return images_brick_url

    def CalculationCube(self):

        images_cube_url=[
            ["v2/通用/基本立体图形/积木/积木1.svg", 1],
            ["v2/通用/基本立体图形/积木/积木2.svg", 7],
            ["v2/通用/基本立体图形/积木/积木3.svg", 4],
            ["v2/通用/基本立体图形/积木/积木4.svg", 6],
            ["v2/通用/基本立体图形/积木/积木5.svg", 8],
            ["v2/通用/基本立体图形/积木/积木6.svg", 5],
            ["v2/通用/基本立体图形/积木/积木9.svg", 3],
            ["v2/通用/基本立体图形/积木/积木11.svg", 2],

        ]

        return  images_cube_url


    def SequencingShape(self):

        images_sequencing_url=[
            ["v2/通用/基本立体图形/长方体_1.svg", "cuboid", "长方体"],
            ["v2/通用/基本立体图形/球体_8.svg", "orb", "球体"],
            ["v2/通用/基本立体图形/圆柱体-2.svg", "cylinder", "圆柱体"],
            ["v2/通用/基本立体图形/正方体_5.svg", "cube", "正方体"],
        ]
        return images_sequencing_url


    def FrontAndBack(self):

        images_animals_url=[
            ["v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_1组/Left/牛_L1.svg","奶牛"],
            ["v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_1组/Left/绵羊_L1.svg","绵羊"],
            ["v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_1组/Left/斑马_L1.svg","斑马"],
            ["v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_2组/Left/松鼠_L1.svg","松鼠"],
            ["v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_2组/Left/兔子_L1.svg","兔子"],
            ["v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_2组/Left/长颈鹿_L1.svg","长颈鹿"],
            ["v2/通用/动物/1-动物基础分类/哺乳动物/哺乳类动物_2组/Left/骆驼_L1.svg","骆驼"],

        ]

        return images_animals_url

    def HouseAndLoaction(self):
        images_house_url=[
            ["v2/通用/通用/房屋/房子_1.svg"],
            ["v2/通用/通用/房屋/房子_2.svg"],
            ["v2/通用/通用/房屋/房子_3.svg"],
            ["v2/通用/通用/房屋/房子_4.svg"],
            ["v2/通用/通用/房屋/房子_5.svg"],
            ["v2/通用/通用/房屋/房子_6.svg"],
            ["v2/通用/通用/房屋/房子_7.svg"],

        ]
        images_tree_url=[
            ["v2/通用/植物/树木/树_1.svg"],
            ["v2/通用/植物/树木/树_2.svg"],
            ["v2/通用/植物/树木/树_3.svg"],
            ["v2/通用/植物/树木/树_4.svg"],
            ["v2/通用/植物/树木/树_5.svg"],
            ["v2/通用/植物/树木/树_6.svg"],
            ["v2/通用/植物/树木/树_7.svg"],
        ]

        return images_house_url,images_tree_url

    def XiaoBaoRun(self):
        images_people_url=[
            ["v2/通用/人物/人物跑步_left/晨晨.svg","晨晨"],
            ["v2/通用/人物/人物跑步_left/大宝.svg","大宝"],
            ["v2/通用/人物/人物跑步_left/东东.svg","东东"],
            ["v2/通用/人物/人物跑步_left/乐乐.svg","乐乐"],
            ["v2/通用/人物/人物跑步_left/妮妮.svg","妮妮"],
            ["v2/通用/人物/人物跑步_left/图图.svg","图图"],
            ["v2/通用/人物/人物跑步_left/小宝.svg","小宝"],
            ["v2/通用/人物/人物跑步_left/小力.svg","小力"],
        ]
        return images_people_url

    def SortedCharacter(self):
        images_character_url=[
            ["v2/通用/人物/人物_front/辰辰.svg", "辰辰"],
            ["v2/通用/人物/人物_front/多多.svg", "多多"],
            ["v2/通用/人物/人物_front/球球.svg", "球球"],
            ["v2/通用/人物/人物_front/天天.svg", "天天"],
            ["v2/通用/人物/人物_front/小莉.svg", "小莉"],
            ["v2/通用/人物/人物_front/月月.svg", "月月"],
            ["v2/通用/人物/人物_front/长今.svg", "长今"],
        ]
        return images_character_url


    def KartoonFigure(self):
        images_figure_url=[
            ["v2/通用/人物/人物头像系列/女孩/1.svg"],
            ["v2/通用/人物/人物头像系列/女孩/3.svg"],
            ["v2/通用/人物/人物头像系列/女孩/4.svg"],
            ["v2/通用/人物/人物头像系列/女孩/5.svg"],
            ["v2/通用/人物/人物头像系列/女孩/6.svg"],
            ["v2/通用/人物/人物头像系列/男孩/6.svg"],
            ["v2/通用/人物/人物头像系列/男孩/7.svg"],
            ["v2/通用/人物/人物头像系列/男孩/8.svg"],
            ["v2/通用/人物/人物头像系列/男孩/9.svg"],
            ["v2/通用/人物/人物头像系列/男孩/10.svg"],
            ["v2/通用/人物/人物头像系列/男孩/11.svg"],
             ]
        return images_figure_url

    def Bird(self):
        images_bird_url=[
            ["animal", "v2/通用/动物/1-动物基础分类/鸟类动物/小鸟组合_1组/小鸟_L1.svg"],
            ["animal", "v2/通用/动物/2-特殊分类-能飞的/蝴蝶_F1.svg"],
            ["animal", "v2/通用/动物/2-特殊分类-能飞的/蜜蜂.svg"],
            ["animal", "v2/通用/动物/2-特殊分类-能飞的/蜜蜂_L1.svg"],
            ["animal", "v2/通用/动物/2-特殊分类-能飞的/蜜蜂_L2.svg"],
            ["animal", "v2/通用/动物/2-特殊分类-能飞的/鸟_R1.svg"],
            ["animal", "v2/通用/动物/2-特殊分类-能飞的/鸟_R2.svg"],
            ["animal", "v2/通用/动物/2-特殊分类-能飞的/鸟_R3.svg"],
            ["animal", "v2/通用/动物/2-特殊分类-能飞的/鸟_R4.svg"],
            ["animal", "v2/通用/动物/2-特殊分类-能飞的/鸟_R5.svg"],
            ["animal", "v2/通用/动物/2-特殊分类-能飞的/鸟_R6.svg"],

        ]
        return images_bird_url



    def RightAndLeftCharacter(self):
        images_character_url=[
            ["v2/通用/人物/人物_back/大人/小冬.svg", "小冬"],
            ["v2/通用/人物/人物_back/大人/小凡.svg", "小凡"],
            ["v2/通用/人物/人物_back/大人/小明.svg", "小明"],
            ["v2/通用/人物/人物_back/大人/小宇.svg", "小宇"],
            ["v2/通用/人物/人物_back/儿童/淘淘.svg", "淘淘"],
            ["v2/通用/人物/人物_back/儿童/阳阳.svg", "阳阳"],

        ]
        return images_character_url

    def Finger(self):
        images_finger_url=[
            ["v2/组件/认识左右/1-5-3-06/右手1.svg", "右手"],
            ["v2/组件/认识左右/1-5-3-06/右手2.svg", "右手"],
            ["v2/组件/认识左右/1-5-3-06/右手3.svg", "右手"],
            ["v2/组件/认识左右/1-5-3-06/左手1.svg", "左手"],

        ]
        return images_finger_url

    def Flower(self):
        images_flower_url=[
            ["v2/通用/235数数/0-5支花/小花1.svg","红色小花"],
            ["v2/通用/235数数/0-5支花/小花2.svg","黄色小花"],
            ["v2/通用/235数数/0-5支花/小花3.svg","橙色小花"],
        ]
        return images_flower_url


    def HatRightAndLeft(self):
        images_hat_url = [
            ["v2/通用/服饰/饰品/帽子/帽子_1.svg", "浅蓝色帽子"],
            ["v2/通用/服饰/饰品/帽子/帽子_2.svg", "棕色帽子"],
            ["v2/通用/服饰/饰品/帽子/帽子_3.svg", "深蓝色帽子"],
            ["v2/通用/服饰/饰品/帽子/帽子_4.svg", "红色帽子"],
            ["v2/通用/服饰/饰品/帽子/帽子_5.svg", "黄色帽子"],
        ]
        return images_hat_url

    def CrabAndOctopus(self):
        images_crab_url=[
            ["v2/通用/动物/1-动物基础分类/节肢动物/Front/螃蟹_F2.svg", "螃蟹"],
            ["v2/通用/动物/1-动物基础分类/节肢动物/Front/蝴蝶_F1.svg", "蝴蝶"],
            ["v2/通用/动物/1-动物基础分类/软体动物/Front/八爪鱼_F1.svg", "八爪鱼"],
            ["v2/通用/动物/1-动物基础分类/腔肠动物/Front/水母_F1.svg", "水母"],
        ]
        return images_crab_url